# DATA CLEANING:
 - data cleaning
 - null records
 - duplicate values

In [1]:
import pandas as pd

In [25]:
df = pd.read_excel('unclean_employee_dataset.xlsx')

## Head() use for display first 5 records

In [13]:
df.head()

,EmployeeID,Name,Department,Email,Phone,Salary,JoinDate
0,51,Sara,Operations,sara51@mail.com,3.312962e+09,146056.0,2019-05-15
1,299,Ahmed,IT,ahmed299@company.com,3.390091e+09,NaN,2015-02-12
2,573,Sara,NaN,sara573@company.com,NaN,0.0,2023-12-29
3,340,Ahmed,Finance,ahmed340@,3.031268e+09,NaN,2024-08-22
4,39,Ali,HR,ali39@,3.149136e+09,NaN,2020-09-18

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  1000 non-null   int64
 1   Name        1000 non-null   object
 2   Department  743 non-null    object
 3   Email       798 non-null    object
 4   Phone       869 non-null    float64
 5   Salary      504 non-null    float64
 6   JoinDate    910 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 54.8+ KB

In [17]:
df.isnull().sum()

EmployeeID      0
Name            0
Department    257
Email         202
Phone         131
Salary        496
JoinDate       90
dtype: int64

# Null:
 - drop: agar kaam data hoto
 - fill: agar zada data hoto

In [19]:
df.duplicated().sum()

np.int64(100)

In [22]:
df[df.duplicated()]

,EmployeeID,Name,Department,Email,Phone,Salary,JoinDate
94,377,Sara,IT,sara377@,3.355945e+09,81537.0,2018-08-28
206,846,Ayesha,IT,ayesha846@mail.com,3.011056e+09,NaN,2021-03-11
214,452,Ayesha,Finance,ayesha452@company.com,3.463973e+09,NaN,2021-07-23
224,833,Bilal,HR,NaN,3.430804e+09,NaN,2017-11-15
238,692,Usman,Operations,usman692@company.com,3.240004e+09,0.0,2022-06-25
...,...,...,...,...,...,...,...
966,342,Sara,IT,sara342@,3.384353e+09,70684.0,2018-10-12
974,355,Noor,Operations,noor355@company.com,3.468901e+09,NaN,2020-03-15
991,386,Ali,NaN,ali386@,3.138366e+09,41422.0,2018-10-27
992,20,Noor,Sales,noor20@None,NaN,NaN,2023-10-19
997,858,Fatima,Finance,fatima858@,3.482932e+09,NaN,2021-12-21

In [24]:
df[df['Salary'].isnull()]

,EmployeeID,Name,Department,Email,Phone,Salary,JoinDate
1,299,Ahmed,IT,ahmed299@company.com,3.390091e+09,NaN,2015-02-12
3,340,Ahmed,Finance,ahmed340@,3.031268e+09,NaN,2024-08-22
4,39,Ali,HR,ali39@,3.149136e+09,NaN,2020-09-18
5,287,Ahmed,Operations,ahmed287@,3.012711e+09,NaN,2024-08-28
10,253,Ahmed,Sales,ahmed253@mail.com,3.051839e+09,NaN,2015-08-31
...,...,...,...,...,...,...,...
995,706,Sara,HR,NaN,3.384409e+09,NaN,2022-08-11
996,633,Fatima,NaN,fatima633@,3.139734e+09,NaN,2019-08-02
997,858,Fatima,Finance,fatima858@,3.482932e+09,NaN,2021-12-21
998,809,Fatima,NaN,fatima809@mail.com,NaN,NaN,2023-10-18
999,695,Ali,HR,NaN,3.168388e+09,NaN,2020-01-31